INSERT INTO menu (code, text, super_code, cate, showed, sort)
VALUES
    ('000316',    '班表調整',                 '0003',   1, 1, 1),
    ('000316001', '發起班表調整申請',         '000316', 2, 1, 1),
    ('000316002', '班表調整審核',         '000316', 2, 1, 2),
    ('000316003', '班表調整駁回',         '000316', 2, 1, 3),
    ('000316004', '查詢待審核班表調整申請',   '000316', 2, 1, 4);

UPDATE role
SET menu_permission = CONCAT(
        menu_permission,
        ',000316',
        ',000316001',
        ',000316002',
        ',000316003',
        ',000316004'
    )
WHERE role_name = 'ADMIN';

