UPDATE menu
SET cate=2
WHERE code in
(
 '000101001','000101002','000101003','000101004','000102001','000102002','000102003','000102004','000102005','000102006',
 '000201001','000201002','000201003','000201004','000201005','000001001','000001002','000001003','000001004','000001005','000002003'
);

INSERT INTO `hrm`.`menu` (`code`, `text`, `super_code`, `cate`, `showed`, `sort`, `remark`, `created_date`,
                          `updated_date`, `created_id`, `updated_id`)
VALUES
    ('000001006', '查詢權限選單', '000001', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('0003', '考勤管理', '', 1, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000301', '各假別預設設定', '0003', 1, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000301001', '查詢預設假別表', '000301', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000301002', '更新預設假別', '000301', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000302', '假別設定', '0003', 1, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000302001', '儲存假別設定', '000302', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000302002', '刪除假別設定', '000302', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000302003', '查詢員工假別設定', '000302', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000302004', '新增年份假別', '000302', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000303', '審核請假紀錄', '0003', 1, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000303001', '查詢待審核的請假記錄', '000303', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000303002', '核准請假紀錄', '000303', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000303003', '駁回請假紀錄', '000303', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000304', '個人請假紀錄', '0003', 1, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000304001', '查询工作排班', '000304', 2, 1, 1, '', NULL, NULL, NULL, NULL),
    ('000304002', '查詢個人請假紀錄', '000304', 2, 1, 1, '', NULL, NULL, NULL, NULL);
